app/views/feeds/show.html.slim

              = submit_tag "Search", name: nil
      - feed.news.desc_sort.each do |news|
        .small-12
          .part-news
---
SELECT "news".* FROM "news" WHERE "news"."feed_id" = $1  ORDER BY updated_at DESC  [["feed_id", 1]]