app/controllers/feeds_controller.rb

INSERT INTO "feeds" ("name", "url", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    feed.save

DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 2]]
---
  def destroy
    feed.destroy